# Лабораторная работа - Настройка NAT для IPv4

![Топология](https://github.com/oreshinog/OTUS/blob/main/Labs/Lab12/Img/Img00.png)

## Таблица адресации

|Устройство|Интерфейс|IP-адрес|Маска подсети|
|--|--|--|--|
|R1|G0/0/0|209.165.200.230|255.255.255.248|
||G0/0/1|192.168.1.1|255.255.255.0|
|R2|G0/0/0|209.165.200.225|255.255.255.248||
||Lo1|209.165.200.1|255.255.255.224||
|S1|VLAN 1|192.168.1.11|255.255.255.0|
|S2|VLAN 1|192.168.1.12|255.255.255.0|
|PC-A|NIC|192.168.1.2|255.255.255.0|
|PC-B|NIC|192.168.1.3|255.255.255.0|

# Задачи

**Часть 1. Создание сети и настройка основных параметров устройства**
**Часть 2. Настройка и проверка NAT для IPv4**
**Часть 3. Настройка и проверка PAT для IPv4**
**Часть 4. Настройка и проверка статического NAT для IPv4.**

# Необходимые ресурсы

2 маршрутизатора (Cisco 4221 с универсальным образом Cisco IOS XE версии 16.9.4 или аналогичным)
2 коммутатора (Cisco 2960 с операционной системой Cisco IOS 15.2(2) (образ lanbasek9) или аналогичная модель)
2 ПК (ОС Windows с программой эмуляции терминалов, такой как Tera Term)
Консольные кабели для настройки устройств Cisco IOS через консольные порты.
Кабели Ethernet, расположенные в соответствии с топологией

# Инструкции

## Часть 1. Создание сети и настройка основных параметров устройства
В первой части лабораторной работы вам предстоит создать топологию сети и настроить базовые параметры для узлов ПК и коммутаторов.
### Шаг 1.1. Подключите кабели сети согласно приведенной топологии.
Подключите устройства в соответствии с топологией и подсоедините соответствующие кабели.

![Топология1](https://github.com/oreshinog/OTUS/blob/main/Labs/Lab12/Img/Img01.png)

### Шаг 1.2. Произведите базовую настройку маршрутизаторов.

Откройте окно конфигурации
1.2.a. Назначьте маршрутизатору имя устройства.
1.2.b. Отключите поиск DNS, чтобы предотвратить попытки маршрутизатора неверно преобразовывать введенные команды таким образом, как будто они являются именами узлов.
1.2.c. Назначьте class в качестве зашифрованного пароля привилегированного режима EXEC.
1.2.d. Назначьте cisco в качестве пароля консоли и включите вход в систему по паролю.
1.2.e. Назначьте cisco в качестве пароля VTY и включите вход в систему по паролю.
1.2.f. Зашифруйте открытые пароли.
1.2.g. Создайте баннер с предупреждением о запрете несанкционированного доступа к устройству.
1.2.h. Настройте IP-адресации интерфейса, как указано в таблице выше.
1.2.i. Настройте маршрут по умолчанию. от R2 до  R1.
1.2.j. Сохраните текущую конфигурацию в файл загрузочной конфигурации.
Закройте окно настройки.

```
Router>enable
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R1
R1(config)#no ip domain lookup
R1(config)#enable secret class
R1(config)#line con 0
R1(config-line)#pass cisco
R1(config-line)#logging synchronous
R1(config-line)#login
R1(config-line)#exit
R1(config)#line vty 0 4
R1(config-line)#pass cisco
R1(config-line)#login
R1(config-line)#exit
R1(config)#line vty 5 15
R1(config-line)#pass cisco
R1(config-line)#login
R1(config-line)#exit
R1(config)#service password-encryption
R1(config)#banner motd #
Enter TEXT message.  End with the character '#'.
Unauthorized access is strictly prohibited. #

R1(config)#int g0/0/0
R1(config-if)#ip add 209.165.200.230 255.255.255.248
R1(config-if)#no sh
R1(config-if)#ex
R1(config)#int g0/0/1
R1(config-if)#ip add 192.168.1.1 255.255.255.0
R1(config-if)#no sh
R1(config-if)#end
R1#
%SYS-5-CONFIG_I: Configured from console by console

R1#copy run sta
Destination filename [startup-config]? 
Building configuration...
[OK]
```

```
Router>enable
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R2
R2(config)#no ip domain lookup
R2(config)#enable secret class
R2(config)#line con 0
R2(config-line)#pass cisco
R2(config-line)#logging synchronous
R2(config-line)#login
R2(config-line)#exit
R2(config)#line vty 0 4
R2(config-line)#pass cisco
R2(config-line)#login
R2(config-line)#exit
R2(config)#line vty 5 15
R2(config-line)#pass cisco
R2(config-line)#login
R2(config-line)#exit
R2(config)#service password-encryption
R2(config)#banner motd #
Enter TEXT message.  End with the character '#'.
Unauthorized access is strictly prohibited. #

R2(config)#int g0/0/0
R2(config-if)#ip add 209.165.200.225 255.255.255.248
R2(config-if)#no sh
R2(config-if)#ex
R2(config)#ip route 0.0.0.0 0.0.0.0 209.165.200.230
R2(config)#int loopback1

R2(config-if)#
%LINK-5-CHANGED: Interface Loopback1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback1, changed state to up

R2(config-if)#ip add 209.165.200.1 255.255.255.224
R2(config-if)#end
R2#
%SYS-5-CONFIG_I: Configured from console by console

R2#copy run sta
Destination filename [startup-config]? 
Building configuration...
[OK]
```

### Шаг 1.3. Настройте базовые параметры каждого коммутатора.
Откройте окно конфигурации
1.3.a. Присвойте коммутатору имя устройства.
1.3.b. Отключите поиск DNS, чтобы предотвратить попытки маршрутизатора неверно преобразовывать введенные команды таким образом, как будто они являются именами узлов.
1.3.c. Назначьте class в качестве зашифрованного пароля привилегированного режима EXEC.
1.3.d. Назначьте cisco в качестве пароля консоли и включите вход в систему по паролю.
1.3.e. Назначьте cisco в качестве пароля VTY и включите вход в систему по паролю.
1.3.f. Зашифруйте открытые пароли.
1.3.g. Создайте баннер с предупреждением о запрете несанкционированного доступа к устройству.
1.3.h. Выключите все интерфейсы, которые не будут использоваться.
1.3.i. Настройте IP-адресации интерфейса, как указано в таблице выше.
1.3.j. Сохраните текущую конфигурацию в файл загрузочной конфигурации.
Закройте окно настройки.

```
witch>enable
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname S1
S1(config)#no ip domain lookup
S1(config)#enable secret class
S1(config)#line con 0
S1(config-line)#pass cisco
S1(config-line)#logging synchronous
S1(config-line)#login
S1(config-line)#exit
S1(config)#line vty 0 4
S1(config-line)#pass cisco
S1(config-line)#login
S1(config-line)#exit
S1(config)#line vty 5 15
S1(config-line)#pass cisco
S1(config-line)#login
S1(config-line)#exit
S1(config)#service password-encryption
S1(config)#banner motd #
Enter TEXT message.  End with the character '#'.
Unauthorized access is strictly prohibited. #

S1(config)#int vlan1
S1(config-if)#ip add 192.168.1.11 255.255.255.0
S1(config-if)#no sh
S1(config-if)#ex
S1(config)#ip default-gateway 192.168.1.1
S1(config)#int ra fa0/2-4,f0/7-24,g0/1-2
S1(config-if-range)#sh
S1(config-if-range)#end
S1#
%SYS-5-CONFIG_I: Configured from console by console

S1#copy run sta
Destination filename [startup-config]? 
Building configuration...
[OK]
```

```
Switch>enable
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname S2
S2(config)#no ip domain lookup
S2(config)#enable secret class
S2(config)#line con 0
S2(config-line)#pass cisco
S2(config-line)#logging synchronous
S2(config-line)#login
S2(config-line)#exit
S2(config)#line vty 0 4
S2(config-line)#pass cisco
S2(config-line)#login
S2(config-line)#exit
S2(config)#line vty 5 15
S2(config-line)#pass cisco
S2(config-line)#login
S2(config-line)#exit
S2(config)#service password-encryption
S2(config)#banner motd #
Enter TEXT message.  End with the character '#'.
Unauthorized access is strictly prohibited. #

S2(config)#int vlan1
S2(config-if)#ip add 192.168.1.12 255.255.255.0
S2(config-if)#no sh
S2(config-if)#ex
S2(config)#ip default-gateway 192.168.1.1
S2(config)#int ra f0/2-17,f0/19-24,g0/1-2
S2(config-if-range)#sh
S2(config-if-range)#end
S2#
%SYS-5-CONFIG_I: Configured from console by console

S2#copy run sta
Destination filename [startup-config]? 
Building configuration...
[OK]
```

### Часть 2. Настройка и проверка NAT для IPv4.
В части 2 необходимо настроить и проверить NAT для IPv4.
#### Шаг 2.1. Настройте NAT на R1, используя пул из трех адресов 209.165.200.226-209.165.200.228. 
Откройте окно конфигурации
#### 2.1.a. Настройте простой список доступа, который определяет, какие хосты будут разрешены для трансляции. В этом случае все устройства в локальной сети R1 имеют право на трансляцию.

```
R1(config)#access-list 1 permit 192.168.1.0 0.0.0.255
```

#### 2.1.b. Создайте пул NAT и укажите ему имя и диапазон используемых адресов.

```
R1(config)#ip nat pool PUBLIC_ACCESS 209.165.200.226 209.165.200.228 netmask 255.255.255.248
```

Примечание. Параметр маски сети не является разделителем IP-адресов. Это должна быть правильная маска подсети для назначенных адресов, даже если вы используете не все адреса подсети в пуле. 

#### 2.1.c. Настройте перевод, связывая ACL и пул с процессом преобразования.

```
R1(config)#ip nat inside source list 1 pool PUBLIC_ACCESS
```

Примечание: Три очень важных момента. Во-первых, слово «inside» имеет решающее значение для работы такого рода NAT. Если вы опустить его, NAT не будет работать. Во-вторых, номер списка — это номер ACL, настроенный на предыдущем шаге. В-третьих, имя пула чувствительно к регистру. 

#### 2.1.d. Задайте внутренний (inside) интерфейс. 

```
R1(config)#int g0/0/1
R1(config-if)#ip nat inside
```

#### 2.1.e. Определите внешний (outside) интерфейс.

```
R1(config)#int g0/0/0
R1(config-if)#ip nat outside
```

#### Шаг 2.2. Проверьте и проверьте конфигурацию. 
#### 2.2.a. С PC-B,  запустите эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. Если эхо-запрос не прошел, выполните процес поиска и устранения неполадок. На R1 отобразите таблицу NAT на R1 с помощью команды show ip nat translations.

```
C:\>ping 209.165.200.1

Pinging 209.165.200.1 with 32 bytes of data:

Reply from 192.168.1.1: Destination host unreachable.
Reply from 192.168.1.1: Destination host unreachable.
Reply from 192.168.1.1: Destination host unreachable.
Reply from 192.168.1.1: Destination host unreachable.

Ping statistics for 209.165.200.1:
    Packets: Sent = 4, Received = 0, Lost = 4 (100% loss),
```
**У R1 нет маршрута до адреса. Добавим маршрут**

```
R1(config)#ip route 209.165.200.0 255.255.255.224 209.165.200.225
```

```
C:\>ping 209.165.200.1

Pinging 209.165.200.1 with 32 bytes of data:

Reply from 209.165.200.1: bytes=32 time<1ms TTL=254
Reply from 209.165.200.1: bytes=32 time<1ms TTL=254
Reply from 209.165.200.1: bytes=32 time<1ms TTL=254
Reply from 209.165.200.1: bytes=32 time<1ms TTL=254

Ping statistics for 209.165.200.1:
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
    Minimum = 0ms, Maximum = 0ms, Average = 0ms
```

```
R1#sh ip nat translations 
Pro  Inside global     Inside local       Outside local      Outside global
icmp 209.165.200.226:17192.168.1.3:17     209.165.200.1:17   209.165.200.1:17
icmp 209.165.200.226:18192.168.1.3:18     209.165.200.1:18   209.165.200.1:18
icmp 209.165.200.226:19192.168.1.3:19     209.165.200.1:19   209.165.200.1:19
```

Вопросы:
Во что был транслирован внутренний локальный адрес PC-B?
Введите ваш ответ здесь. **В адрес из NAT пула адресов на маршрутизаторе R1 - 209.165.200.226**
 
Какой тип адреса NAT является переведенным адресом? **Inside local - внутренний локальный**
 
#### 1.1.a. С PC-A, запустите  эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. Если эхо-запрос не прошел, выполните отладку. На R1 отобразите таблицу NAT на R1 с помощью команды show ip nat translations.

```
C:\>ping 209.165.200.1

Pinging 209.165.200.1 with 32 bytes of data:

Reply from 209.165.200.1: bytes=32 time<1ms TTL=254
Reply from 209.165.200.1: bytes=32 time<1ms TTL=254
Reply from 209.165.200.1: bytes=32 time<1ms TTL=254
Reply from 209.165.200.1: bytes=32 time<1ms TTL=254

Ping statistics for 209.165.200.1:
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
    Minimum = 0ms, Maximum = 0ms, Average = 0ms
```

```
R1#sh ip nat translations 
Pro  Inside global     Inside local       Outside local      Outside global
icmp 209.165.200.226:1 192.168.1.2:1      209.165.200.1:1    209.165.200.1:1
icmp 209.165.200.226:2 192.168.1.2:2      209.165.200.1:2    209.165.200.1:2
icmp 209.165.200.226:3 192.168.1.2:3      209.165.200.1:3    209.165.200.1:3
icmp 209.165.200.226:4 192.168.1.2:4      209.165.200.1:4    209.165.200.1:4
```

#### 1.1.b. Обратите внимание, что предыдущая трансляция для PC-B все еще находится в таблице. Из S1, эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. Если эхо-запрос не прошел, выполните отладку. На R1 отобразите таблицу NAT на R1 с помощью команды show ip nat translations.

```
S1#ping 209.165.200.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 209.165.200.1, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 0/0/0 ms
```

```
R1#sh ip nat translations 
Pro  Inside global     Inside local       Outside local      Outside global
icmp 209.165.200.226:17192.168.1.11:17    209.165.200.1:17   209.165.200.1:17
icmp 209.165.200.226:18192.168.1.11:18    209.165.200.1:18   209.165.200.1:18
icmp 209.165.200.226:19192.168.1.11:19    209.165.200.1:19   209.165.200.1:19
icmp 209.165.200.226:20192.168.1.11:20    209.165.200.1:20   209.165.200.1:20
```

#### 1.1.c. Теперь запускаем пинг R2 Lo1 из S2. На этот раз перевод завершается неудачей, и вы получаете эти сообщения (или аналогичные) на консоли R1:

```
S2#ping 209.165.200.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 209.165.200.1, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
```

**Сообщений в консоли не было**

#### 1.1.d. Это ожидаемый результат, потому что выделено только 3 адреса, и мы попытались ping Lo1 с четырех устройств. Напомним, что NAT — это трансляция «один-в-один». Как много выделено трансляций? Введите команду show ip nat translations verbose , и вы увидите, что ответ будет 24 часа.

```
R1#show ip nat translations verbose
                            ^
% Invalid input detected at '^' marker.
```
**Нет такой команды в CPT**

#### 1.1.e. Учитывая, что пул ограничен тремя адресами, NAT для пула адресов недостаточно для нашего приложения. Очистите преобразование NAT и статистику, и мы перейдем к PAT.

```
R1#clear ip nat translation *
R1#clear ip nat ?
  translation  Clear dynamic translation
```
**Нет в CPT команды clear ip nat statistics**

### Часть 3. Настройка и проверка PAT для IPv4.
В части 3 необходимо настроить замену NAT на PAT в пул адресов, а затем на PAT с помощью интерфейса.
#### Шаг 2.1. Удалите команду преобразования на R1.
Откройте окно конфигурации
Компоненты конфигурации преобразования адресов в основном одинаковы; что-то (список доступа) для идентификации адресов, пригодных для перевода, дополнительно настроенный пул адресов для их преобразования и команды, необходимые для идентификации внутреннего и внешнего интерфейсов. Из части 1 наш список доступа (список доступа 1) по-прежнему корректен для сетевого сценария, поэтому нет необходимости воссоздавать его. Мы будем использовать один и тот же пул адресов, поэтому нет необходимости воссоздавать эту конфигурацию. Кроме того, внутренний и внешний интерфейсы не меняются. Чтобы начать работу в части 3, удалите команду, связывающую ACL и пул вместе.

```
R1(config)#no ip nat inside source list 1 pool PUBLIC_ACCESS
```

#### Шаг 2.2. Добавьте команду PAT на R1.
Теперь настройте преобразование PAT в пул адресов (помните, что ACL и Pool уже настроены, так что это единственная команда, которую нам нужно изменить с NAT на PAT).

```
R1(config)#ip nat inside source list 1 pool PUBLIC_ACCESS overload
```

#### Шаг 2.3. Протестируйте и проверьте конфигурацию.
2.3.a. Давайте проверим, что PAT работает. С PC-B,  запустите эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. Если эхо-запрос не прошел, выполните отладку. На R1 отобразите таблицу NAT на R1 с помощью команды show ip nat translations.

```
C:\>ping 209.165.200.1

Pinging 209.165.200.1 with 32 bytes of data:

Reply from 209.165.200.1: bytes=32 time<1ms TTL=254
Reply from 209.165.200.1: bytes=32 time<1ms TTL=254
Reply from 209.165.200.1: bytes=32 time<1ms TTL=254
Reply from 209.165.200.1: bytes=32 time<1ms TTL=254

Ping statistics for 209.165.200.1:
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
    Minimum = 0ms, Maximum = 0ms, Average = 0ms
```

```
R1#show ip nat translations
Pro  Inside global     Inside local       Outside local      Outside global
icmp 209.165.200.228:29192.168.1.3:29     209.165.200.1:29   209.165.200.1:29
icmp 209.165.200.228:30192.168.1.3:30     209.165.200.1:30   209.165.200.1:30
icmp 209.165.200.228:31192.168.1.3:31     209.165.200.1:31   209.165.200.1:31
icmp 209.165.200.228:32192.168.1.3:32     209.165.200.1:32   209.165.200.1:32
```

Вопросы:
Во что был транслирован внутренний локальный адрес PC-B? **209.165.200.228:29**
 
Какой тип адреса NAT является переведенным адресом?  **Inside local - внутренний локальный**
 
Чем отличаются выходные данные команды show ip nat translations из упражнения NAT?
Введите ваш ответ здесь. **В данном случае разницы нет, но вообще, PAT использует только один внешний IP адрес, в сочетании с уникальным портом** 
 
#### 1.1.a. С PC-A, запустите эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. Если эхо-запрос не прошел, выполните отладку. На R1 отобразите таблицу NAT на R1 с помощью команды show ip nat translations.

```
C:\>ping 209.165.200.1

Pinging 209.165.200.1 with 32 bytes of data:

Reply from 209.165.200.1: bytes=32 time<1ms TTL=254
Reply from 209.165.200.1: bytes=32 time<1ms TTL=254
Reply from 209.165.200.1: bytes=32 time<1ms TTL=254
Reply from 209.165.200.1: bytes=32 time=1ms TTL=254

Ping statistics for 209.165.200.1:
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
    Minimum = 0ms, Maximum = 1ms, Average = 0ms
```

```
R1#sh ip nat tran
Pro  Inside global     Inside local       Outside local      Outside global
icmp 209.165.200.228:13192.168.1.2:13     209.165.200.1:13   209.165.200.1:13
icmp 209.165.200.228:14192.168.1.2:14     209.165.200.1:14   209.165.200.1:14
icmp 209.165.200.228:15192.168.1.2:15     209.165.200.1:15   209.165.200.1:15
icmp 209.165.200.228:16192.168.1.2:16     209.165.200.1:16   209.165.200.1:16
icmp 209.165.200.228:33192.168.1.3:33     209.165.200.1:33   209.165.200.1:33
icmp 209.165.200.228:34192.168.1.3:34     209.165.200.1:34   209.165.200.1:34
icmp 209.165.200.228:35192.168.1.3:35     209.165.200.1:35   209.165.200.1:35
icmp 209.165.200.228:36192.168.1.3:36     209.165.200.1:36   209.165.200.1:36
```

Обратите внимание, что есть только одна трансляция. Отправьте ping еще раз, и быстро вернитесь к маршрутизатору и введите команду show ip nat translations verbose , и вы увидите, что произошло.
Как вы можете видеть, время ожидания перевода было отменено с 24 часов до 1 минуты.
#### 1.1.b. Генерирует трафик с нескольких устройств для наблюдения PAT. На PC-A и PC-B используйте параметр -t с командой ping, чтобы отправить безостановочный ping на интерфейс Lo1 R2 (ping -t 209.165.200.1), затем вернитесь к R1 и выполните команду show ip nat translations:

```
R1#sh ip nat tran
Pro  Inside global     Inside local       Outside local      Outside global
icmp 209.165.200.228:17192.168.1.2:17     209.165.200.1:17   209.165.200.1:17
icmp 209.165.200.228:18192.168.1.2:18     209.165.200.1:18   209.165.200.1:18
icmp 209.165.200.228:19192.168.1.2:19     209.165.200.1:19   209.165.200.1:19
icmp 209.165.200.228:20192.168.1.2:20     209.165.200.1:20   209.165.200.1:20
icmp 209.165.200.228:21192.168.1.2:21     209.165.200.1:21   209.165.200.1:21
icmp 209.165.200.228:22192.168.1.2:22     209.165.200.1:22   209.165.200.1:22
icmp 209.165.200.228:23192.168.1.2:23     209.165.200.1:23   209.165.200.1:23
icmp 209.165.200.228:24192.168.1.2:24     209.165.200.1:24   209.165.200.1:24
icmp 209.165.200.228:25192.168.1.2:25     209.165.200.1:25   209.165.200.1:25
icmp 209.165.200.228:26192.168.1.2:26     209.165.200.1:26   209.165.200.1:26
icmp 209.165.200.228:27192.168.1.2:27     209.165.200.1:27   209.165.200.1:27
icmp 209.165.200.228:28192.168.1.2:28     209.165.200.1:28   209.165.200.1:28
icmp 209.165.200.228:29192.168.1.2:29     209.165.200.1:29   209.165.200.1:29
icmp 209.165.200.228:37192.168.1.3:37     209.165.200.1:37   209.165.200.1:37
icmp 209.165.200.228:38192.168.1.3:38     209.165.200.1:38   209.165.200.1:38
icmp 209.165.200.228:39192.168.1.3:39     209.165.200.1:39   209.165.200.1:39
icmp 209.165.200.228:40192.168.1.3:40     209.165.200.1:40   209.165.200.1:40
icmp 209.165.200.228:41192.168.1.3:41     209.165.200.1:41   209.165.200.1:41
icmp 209.165.200.228:42192.168.1.3:42     209.165.200.1:42   209.165.200.1:42
icmp 209.165.200.228:43192.168.1.3:43     209.165.200.1:43   209.165.200.1:43
icmp 209.165.200.228:44192.168.1.3:44     209.165.200.1:44   209.165.200.1:44
 --More-- 
```

Обратите внимание, что внутренний глобальный адрес одинаков для обоих сеансов. 
Вопрос:
Как маршрутизатор отслеживает, куда идут ответы?  **Маршрутизатор сопоставляет уникальные пары ip:порт в таблице NAT**
 
#### 1.1.a. PAT в пул является очень эффективным решением для малых и средних организаций. Тем не менее есть неиспользуемые адреса IPv4, задействованные в этом сценарии. Мы перейдем к PAT с перегрузкой интерфейса, чтобы устранить эту трату IPv4 адресов. Остановите ping на PC-A и PC-B с помощью комбинации клавиш Control-C, затем очистите трансляции и статистику:

```
R1# clear ip nat translations * 
```

#### Шаг 1.2. На R1 удалите команды преобразования nat pool.
Опять же, наш список доступа (список доступа 1) по-прежнему корректен для сетевого сценария, поэтому нет необходимости воссоздавать его. Кроме того, внутренний и внешний интерфейсы не меняются. Чтобы начать работу с PAT к интерфейсу, очистите конфигурацию, удалив пул NAT и команду, связывающую ACL и пул вместе.

```
R1(config)#no ip nat inside source list 1 pool PUBLIC_ACCESS overload
R1(config)#no ip nat pool PUBLIC_ACCESS
```

#### Шаг 1.3. Добавьте команду PAT overload, указав внешний интерфейс.
#### Добавьте команду PAT, которая вызовет перегрузку внешнего интерфейса.

```
R1(config)#ip nat inside source list 1 interface g0/0/0 overload
```

#### Шаг 1.4. Протестируйте и проверьте конфигурацию. 
#### 1.4.a. Давайте проверим PAT, чтобы интерфейс работал. С PC-B,  запустите эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. Если эхо-запрос не прошел, выполните отладку. На R1 отобразите таблицу NAT на R1 с помощью команды show ip nat translations.

```
C:\>ping 209.165.200.1

Pinging 209.165.200.1 with 32 bytes of data:

Reply from 209.165.200.1: bytes=32 time<1ms TTL=254
Reply from 209.165.200.1: bytes=32 time<1ms TTL=254
Reply from 209.165.200.1: bytes=32 time<1ms TTL=254
Reply from 209.165.200.1: bytes=32 time<1ms TTL=254

Ping statistics for 209.165.200.1:
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
    Minimum = 0ms, Maximum = 0ms, Average = 0ms
```

```
R1#sh ip nat tran
Pro  Inside global     Inside local       Outside local      Outside global
icmp 209.165.200.230:186192.168.1.3:186    209.165.200.1:186  209.165.200.1:186
icmp 209.165.200.230:187192.168.1.3:187    209.165.200.1:187  209.165.200.1:187
icmp 209.165.200.230:188192.168.1.3:188    209.165.200.1:188  209.165.200.1:188
icmp 209.165.200.230:189192.168.1.3:189    209.165.200.1:189  209.165.200.1:189
```

#### 1.4.b. Сделайте трафик с нескольких устройств для наблюдения PAT. На PC-A и PC-B используйте параметр -t с командой ping для отправки безостановочного ping на интерфейс Lo1 R2 (ping -t 209.165.200.1). На S1 и S2 выполните привилегированную команду exec ping 209.165.200.1 повторить 2000. Затем вернитесь к R1 и выполните команду show ip nat translations.

```
R1#sh ip nat tran
Pro  Inside global     Inside local       Outside local      Outside global
icmp 209.165.200.230:11192.168.1.12:11    209.165.200.1:11   209.165.200.1:11
icmp 209.165.200.230:12192.168.1.12:12    209.165.200.1:12   209.165.200.1:12
icmp 209.165.200.230:13192.168.1.12:13    209.165.200.1:13   209.165.200.1:13
icmp 209.165.200.230:14192.168.1.12:14    209.165.200.1:14   209.165.200.1:14
icmp 209.165.200.230:15192.168.1.12:15    209.165.200.1:15   209.165.200.1:15
icmp 209.165.200.230:326192.168.1.2:326    209.165.200.1:326  209.165.200.1:326
icmp 209.165.200.230:327192.168.1.2:327    209.165.200.1:327  209.165.200.1:327
icmp 209.165.200.230:328192.168.1.2:328    209.165.200.1:328  209.165.200.1:328
icmp 209.165.200.230:329192.168.1.2:329    209.165.200.1:329  209.165.200.1:329
icmp 209.165.200.230:330192.168.1.2:330    209.165.200.1:330  209.165.200.1:330
icmp 209.165.200.230:331192.168.1.2:331    209.165.200.1:331  209.165.200.1:331
icmp 209.165.200.230:332192.168.1.2:332    209.165.200.1:332  209.165.200.1:332
icmp 209.165.200.230:351192.168.1.3:351    209.165.200.1:351  209.165.200.1:351
icmp 209.165.200.230:352192.168.1.3:352    209.165.200.1:352  209.165.200.1:352
icmp 209.165.200.230:353192.168.1.3:353    209.165.200.1:353  209.165.200.1:353
icmp 209.165.200.230:354192.168.1.3:354    209.165.200.1:354  209.165.200.1:354
icmp 209.165.200.230:355192.168.1.3:355    209.165.200.1:355  209.165.200.1:355
icmp 209.165.200.230:36192.168.1.11:36    209.165.200.1:36   209.165.200.1:36
icmp 209.165.200.230:37192.168.1.11:37    209.165.200.1:37   209.165.200.1:37
icmp 209.165.200.230:38192.168.1.11:38    209.165.200.1:38   209.165.200.1:38
icmp 209.165.200.230:39192.168.1.11:39    209.165.200.1:39   209.165.200.1:39
icmp 209.165.200.230:40192.168.1.11:40    209.165.200.1:40   209.165.200.1:40
```

Теперь все внутренние глобальные адреса сопоставляются с IP-адресом интерфейса g0/0/0.
Остановите все пинги. На PC-A и PC-B, используя комбинацию клавиш CTRL-C.
Закройте окно настройки.
#### Часть 2. Настройка и проверка статического NAT для IPv4.
В части 4 будет настроена статическая NAT таким образом, чтобы PC-A был доступен напрямую из Интернета. PC-A будет доступен из R2 по адресу 209.165.200.229.
Примечание. Конфигурация, которую вы собираетесь завершить, не соответствует рекомендуемым практикам для шлюзов, подключенных к Интернету. Эта лаборатория полностью опускает стандартные методы безопасности, чтобы сосредоточиться на успешной конфигурации статического NAT. В производственной среде решающее значение для удовлетворения этого требования будет иметь тщательная координация между сетевой инфраструктурой и группами безопасности. 
#### Шаг 2.1. На R1 очистите текущие трансляции и статистику.
Откройте окно конфигурации

```
R1#clear ip nat translation *
```

#### Шаг 2.2. На R1 настройте команду NAT, необходимую для статического сопоставления внутреннего адреса с внешним адресом.
Для этого шага настройте статическое сопоставление между ~~192.168.1.11 и 209.165.200.1~~ 192.168.1.2 и 209.165.200.229 **(опечатка?)**  с помощью следующей команды:

```
R1(config)#ip nat inside source static 192.168.1.2 209.165.200.229 
```

#### Шаг 2.3. Протестируйте и проверьте конфигурацию.
#### 2.3.a. Давайте проверим, что статический NAT работает. На R1 отобразите таблицу NAT на R1 с помощью команды show ip nat translations, и вы увидите статическое сопоставление.

```
R1#sh ip nat tran
Pro  Inside global     Inside local       Outside local      Outside global
---  209.165.200.229   192.168.1.2        ---                ---
```

#### 2.3.b. Таблица перевода показывает, что статическое преобразование действует. Проверьте это, запустив ping  с R2 на 209.165.200.229. Пинги должны работать.

```
R2#ping 209.165.200.229

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 209.165.200.229, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 0/0/0 ms
```

#### Примечание. Возможно, вам придется отключить брандмауэр ПК для работы pings.
#### 2.3.c. На R1 отобразите таблицу NAT на R1 с помощью команды show ip nat translations, и вы увидите статическое сопоставление и преобразование на уровне порта для входящих pings.

```
R1#sh ip nat tran
Pro  Inside global     Inside local       Outside local      Outside global
icmp 209.165.200.229:10192.168.1.2:10     209.165.200.225:10 209.165.200.225:10
icmp 209.165.200.229:6 192.168.1.2:6      209.165.200.225:6  209.165.200.225:6
icmp 209.165.200.229:7 192.168.1.2:7      209.165.200.225:7  209.165.200.225:7
icmp 209.165.200.229:8 192.168.1.2:8      209.165.200.225:8  209.165.200.225:8
icmp 209.165.200.229:9 192.168.1.2:9      209.165.200.225:9  209.165.200.225:9
---  209.165.200.229   192.168.1.2        ---                ---
```
#### Это подтверждает, что статический NAT работает.